package 변수및자료형;

public class Ex03변수형 {

	public static void main(String[] args) {


		// 변수명 사용 규칙
		// 1. 키워드는 사용 불가(int,for...)
		// -----> eclipse 작성 시 색깔이 변한다면 키워드다
		// 2. 대소문자를 구분하고 변수의 이름은 길이에 제한이없다.
		// -> 변수명은 의미전달이 중요하다. a,b,c,d 보다 단어 사용 하기(키워드제외)
		// 3. 숫자로 시작할 수 없다.
		// --->> 숫자로 값으로 인식되므로
		// 4. 특수문자를 사용할 수 있으나 _와 $만 사용할 수 있다.
		
		
		// 자바 개발자에게 권장되는 규칙
		// 1. 변수를 시작할 때 소문자로 시작한다.
		// 2. 변수 이름이 여러 단어로 이루어진 경우 이어지는 단어의 첫 글자를 대문자로 한다. 
		// 카멜식 기법(camel)
		// --->>> int inputNumber = 4;
		
		
		
		
		
		
		
	}

}
